parent('Алексей Владимирович Баранников','Степан Алексеевич Баранников').
parent('Алексей Владимирович Баранников','Василиса Алексеевна Баранникова').
parent('Варвара Юрьевна Максимова','Степан Алексеевич Баранников').
parent('Варвара Юрьевна Максимова','Василиса Алексеевна Баранникова').
parent('Владимир Адольфович Баранников','Алексей Владимирович Баранников').
parent('Владимир Адольфович Баранников','Андрей Владимирович Баранников').
parent('Ирина Владимировна Баврина','Алексей Владимирович Баранников').
parent('Ирина Владимировна Баврина','Андрей Владимирович Баранников').
parent('Андрей Владимирович Баранников','Макар Андреевич Баранников').
parent('Ольга Ельцина','Макар Андреевич Баранников').
parent('Юрий Сергеевич Максимов','Варвара Юрьевна Максимова').
parent('Любовь Аркадьевна Крылова','Варвара Юрьевна Максимова').
parent('Аркадий Александрович Крылов','Любовь Аркадьевна Крылова').
parent('Татьяна Ивановна Пушкина','Любовь Аркадьевна Крылова').
parent('Адольф Венедиктович Шнейдер','Александр Адольфович Баранников').
parent('Адольф Венедиктович Шнейдер','Владимир Адольфович Баранников').
parent('Агния Александровна Баранникова','Александр Адольфович Баранников').
parent('Агния Александровна Баранникова','Владимир Адольфович Баранников').
parent('Владимир Алексеевич Баврин','Елена Владимировна Баврина').
parent('Владимир Алексеевич Баврин','Ирина Владимировна Баврина').
parent('Лидия Федоровна Скотникова','Елена Владимировна Баврина').
parent('Лидия Федоровна Скотникова','Ирина Владимировна Баврина').
parent('Михаил Матвиец','Надежда Михайловна Матвиец').
parent('Татьяна Ивановна Пушкина','Надежда Михайловна Матвиец').
parent('Сергей Васильевич Максимов','Юрий Сергеевич Максимов').
parent('Сергей Васильевич Максимов','Валерий Сергеевич Максимов').
parent('Сергей Васильевич Максимов','Лидия Максимова').
parent('Варвара Петровна Петрова','Юрий Сергеевич Максимов').
parent('Варвара Петровна Петрова','Валерий Сергеевич Максимов').
parent('Варвара Петровна Петрова','Лидия Максимова').
parent('Надежда Михайловна Матвиец','Михаил Пославский').
parent('Владимир Иванович Власов','Иван Владимирович Власов').
parent('Владимир Иванович Власов','Мария Владимировна Власова').
parent('Елена Владимировна Баврина','Иван Владимирович Власов').
parent('Елена Владимировна Баврина','Мария Владимировна Власова').
parent('Александр Адольфович Баранников','Евгений Александрович Баранников').
parent('Александр Адольфович Баранников','Елена Александровна Баранникова').
parent('Маргарита ','Евгений Александрович Баранников').
parent('Маргарита ','Елена Александровна Баранникова').
parent('Иван Владимирович Власов','Александра Ивановна Власова').
parent('Татьяна ','Александра Ивановна Власова').
parent('Евгений Ломакин','Роман Евгеньевич Ломакин').
parent('Евгений Ломакин','Максим Евгеньевич Власов').
parent('Мария Владимировна Власова','Роман Евгеньевич Ломакин').
parent('Мария Владимировна Власова','Максим Евгеньевич Власов').
parent('Unknown','Никита ').
parent('Елена Александровна Баранникова','Никита ').
sex('Степан Алексеевич Баранников','m').
sex('Василиса Алексеевна Баранникова','f').
sex('Алексей Владимирович Баранников','m').
sex('Варвара Юрьевна Максимова','f').
sex('Андрей Владимирович Баранников','m').
sex('Владимир Адольфович Баранников','m').
sex('Ирина Владимировна Баврина','f').
sex('Ольга Ельцина','f').
sex('Юрий Сергеевич Максимов','m').
sex('Любовь Аркадьевна Крылова','f').
sex('Аркадий Александрович Крылов','m').
sex('Татьяна Ивановна Пушкина','f').
sex('Адольф Венедиктович Шнейдер','m').
sex('Агния Александровна Баранникова','f').
sex('Владимир Алексеевич Баврин','m').
sex('Лидия Федоровна Скотникова','f').
sex('Макар Андреевич Баранников','m').
sex('Александр Адольфович Баранников','m').
sex('Надежда Михайловна Матвиец','f').
sex('Сергей Васильевич Максимов','m').
sex('Варвара Петровна Петрова','f').
sex('Валерий Сергеевич Максимов','m').
sex('Лидия Максимова','f').
sex('Михаил Матвиец','m').
sex('Михаил Пославский','m').
sex('Елена Владимировна Баврина','f').
sex('Иван Владимирович Власов','m').
sex('Владимир Иванович Власов','m').
sex('Мария Владимировна Власова','f').
sex('Маргарита ','f').
sex('Евгений Александрович Баранников','m').
sex('Елена Александровна Баранникова','f').
sex('Александра Ивановна Власова','f').
sex('Татьяна ','f').
sex('Максим Евгеньевич Власов','m').
sex('Евгений Ломакин','m').
sex('Роман Евгеньевич Ломакин','m').
sex('Никита ','m').
sex('Unknown','m').
